{
  "add_bias_linear": false,
  "architectures": [
    "Zamba2ForCausalLM"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 1,
  "conv_dimension": 4,
  "eos_token_id": 2,
  "expansion_factor": 2,
  "ffn_hidden_size": 8192,
  "ft_lora": false,
  "gated_linear_unit": true,
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "kv_channels": 64,
  "layers_block_type": [
    "m",
    "m",
    "m",
    "m",
    "m",
    "g",
    "m",
    "m",
    "m",
    "m",
    "m",
    "g",
    "m",
    "m"
  ],
  "lora_rank": 128,
  "mamba_headdim": 64,
  "mamba_ngroups": 1,
  "max_position_embeddings": 8192,
  "model_type": "zamba2",
  "num_attention_heads": 32,
  "num_hidden_layers": 14,
  "num_key_value_heads": 32,
  "num_logits_to_keep": 1,
  "num_mem_blocks": 1,
  "num_query_groups": 32,
  "pad_token_id": 0,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000,
  "sliding_window": null,
  "state_size": 128,
  "torch_dtype": "float16",
  "transformers_version": "4.43.0.dev0",
  "use_cache": true,
  "use_long_context": false,
  "use_mamba_kernels": true,
  "use_mem_eff_path": true,
  "use_mem_rope": true,
  "use_shared_attention_lora": true,
  "use_shared_block_lora": true,
  "vocab_size": 50277
}
